<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"9e96891eedd8c579ba29bc7e92000ccd17559ef7e98496f3e710d5b954b371f0","plan_job_ref":"Job Environment Main - Plan #1441 at https://github.com/jarrod-lowe/wildsea/actions/runs/16613810627","plan_out_hash":"bf312ecc8c252637a60e39f73bb711560d17083a814703fdb9388b6d8a46defe","plan_hash":"981477309d615b4ed8a058316a64a8741361c285985408d97434cf189717e0a0","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
```
</details>
<details>
<summary>Plan: 4 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_datasource.local will be created
+   resource "aws_appsync_datasource" "local" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       description = "Local/None data source for subscription resolvers"
+       id          = (known after apply)
+       name        = "Wildsea_primary_local"
+       type        = "NONE"
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
!~      schema                        = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools(cognito_groups: ["CreateGame"])
                joinGame(input: JoinGameInput!): PlayerSheetSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                updateJoinCode(input: UpdateJoinCodeInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
                createShip(input: CreateShipInput!): PlayerSheetSummary! @aws_cognito_user_pools
                rollDice(input: RollDiceInput!): DiceRoll! @aws_cognito_user_pools
          +     updateUserSettings(input: UpdateUserSettingsInput!): UserSettings! @aws_cognito_user_pools
            }
            
            type Query {
                getGame(input: GetGameInput): Game! @aws_cognito_user_pools
                getGames: [PlayerSheetSummary!] @aws_cognito_user_pools
                getCharacterTemplates(input: GetCharacterTemplatesInput!): [CharacterTemplateMetadata!]! @aws_cognito_user_pools
                getCharacterTemplate(input: GetCharacterTemplateInput!): [TemplateSectionData!]! @aws_cognito_user_pools
          +     getUserSettings: UserSettings @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createShip", "joinGame"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "deleteGame"])
              diceRolled(gameId: ID!): DiceRoll @aws_subscribe(mutations: ["rollDice"])
          +   updatedUserSettings: UserSettings @aws_subscribe(mutations: ["updateUserSettings"])
            }
            
            input GetGameInput {
              gameId: ID!
            }
            
            input GetCharacterTemplatesInput {
              gameType: String!
              language: String!
            }
            
            input GetCharacterTemplateInput {
              templateName: String!
              gameType: String!
              language: String!
            }
            
            input CreateGameInput {
                name: String!
                gameType: String!
                description: String
            }
            
            input JoinGameInput {
              joinCode: String!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input UpdateJoinCodeInput {
              gameId: ID!
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              joinCode: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinCode: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            input CreateShipInput {
              gameId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String!
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              fireflyUserId: ID!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            union Dice = SingleDie
            
            input DiceInput {
              type: String!
              size: Int!
            }
            
            input RollDiceInput {
              gameId: ID!
              dice: [DiceInput!]!
              action: String
              rollType: String!
              target: Int!
              onBehalfOf: ID
            }
            
            type DiceRoll @aws_cognito_user_pools {
              gameId: ID!
              playerId: ID!
              playerName: String!
              dice: [Dice!]!
              rollType: String!
              target: Int!
              grade: String!
              action: String
              diceList: [Dice!]!
              value: Int!
              rolledAt: AWSDateTime!
              rolledBy: String!
              proxyRoll: Boolean!
              type: String!
              messageIndex: Int!
            }
            
            type SingleDie @aws_cognito_user_pools {
              type: String!
              size: Int!
              value: Int!
            }
            
            type CharacterTemplateMetadata @aws_cognito_user_pools {
              templateName: String!
              displayName: String!
              gameType: String!
              language: String!
            }
            
            type TemplateSectionData @aws_cognito_user_pools {
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
            }
          + 
          + type UserSettings @aws_cognito_user_pools {
          +   userId: ID!
          +   settings: AWSJSON!
          +   type: String!
          +   createdAt: AWSDateTime!
          +   updatedAt: AWSDateTime!
          + }
          + 
          + input UpdateUserSettingsInput {
          +   settings: AWSJSON!
          + }
        EOT
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["getUserSettings"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // query/getUserSettings/getUserSettings.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixSettings = "SETTINGS";
            
            // query/getUserSettings/getUserSettings.ts
            function request(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              return {
                operation: "GetItem",
                key: {
                  PK: util.dynamodb.toString(`${DDBPrefixSettings}#${identity.sub}`),
                  SK: util.dynamodb.toString(`${DDBPrefixSettings}#`)
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2V0VXNlclNldHRpbmdzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNPL0MsSUFBTSxvQkFBb0I7OztBREYxQixTQUFTLFFBQVEsU0FBMEM7QUFDaEUsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSztBQUFBLE1BQ0gsSUFBSSxLQUFLLFNBQVMsU0FBUyxHQUFHLGlCQUFpQixJQUFJLFNBQVMsR0FBRyxFQUFFO0FBQUEsTUFDakUsSUFBSSxLQUFLLFNBQVMsU0FBUyxHQUFHLGlCQUFpQixHQUFHO0FBQUEsSUFDcEQ7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBdUM7QUFDOUQsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsU0FBTyxRQUFRO0FBQ2pCOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source = "Wildsea_primary"
+       field       = "getUserSettings"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Query"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["updateUserSettings"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // mutation/updateUserSettings/updateUserSettings.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixSettings = "SETTINGS";
            
            // lib/constants/entityTypes.ts
            var TypeSettings = "SETTINGS";
            
            // lib/constants/defaults.ts
            var MaxUserSettingsSize = 1024;
            
            // mutation/updateUserSettings/updateUserSettings.ts
            function request(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              const { settings } = context.arguments.input;
              const settingsSize = settings.length;
              if (settingsSize > MaxUserSettingsSize) {
                util.error(
                  `Settings exceed ${MaxUserSettingsSize} byte size limit`,
                  "SettingsSizeExceededException"
                );
              }
              const now = util.time.nowISO8601();
              const item = {
                userId: identity.sub,
                settings,
                type: TypeSettings,
                createdAt: now,
                updatedAt: now
              };
              return {
                operation: "PutItem",
                key: {
                  PK: util.dynamodb.toString(`${DDBPrefixSettings}#${identity.sub}`),
                  SK: util.dynamodb.toString(`${DDBPrefixSettings}#`)
                },
                attributeValues: util.dynamodb.toMapValues(item)
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsidXBkYXRlVXNlclNldHRpbmdzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2VudGl0eVR5cGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGVmYXVsdHMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUE2Qzs7O0FDTy9DLElBQU0sb0JBQW9COzs7QUNBMUIsSUFBTSxlQUFlOzs7QUNOckIsSUFBTSxzQkFBc0I7OztBSFM1QixTQUFTLFFBQ2QsU0FDd0I7QUFDeEIsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsUUFBTSxFQUFFLFNBQVMsSUFBSSxRQUFRLFVBQVU7QUFHdkMsUUFBTSxlQUFlLFNBQVM7QUFDOUIsTUFBSSxlQUFlLHFCQUFxQjtBQUN0QyxTQUFLO0FBQUEsTUFDSCxtQkFBbUIsbUJBQW1CO0FBQUEsTUFDdEM7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUVBLFFBQU0sTUFBTSxLQUFLLEtBQUssV0FBVztBQUVqQyxRQUFNLE9BQXFCO0FBQUEsSUFDekIsUUFBUSxTQUFTO0FBQUEsSUFDakI7QUFBQSxJQUNBLE1BQU07QUFBQSxJQUNOLFdBQVc7QUFBQSxJQUNYLFdBQVc7QUFBQSxFQUNiO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSztBQUFBLE1BQ0gsSUFBSSxLQUFLLFNBQVMsU0FBUyxHQUFHLGlCQUFpQixJQUFJLFNBQVMsR0FBRyxFQUFFO0FBQUEsTUFDakUsSUFBSSxLQUFLLFNBQVMsU0FBUyxHQUFHLGlCQUFpQixHQUFHO0FBQUEsSUFDcEQ7QUFBQSxJQUNBLGlCQUFpQixLQUFLLFNBQVMsWUFBWSxJQUFJO0FBQUEsRUFDakQ7QUFDRjtBQUVPLFNBQVMsU0FDZCxTQUNjO0FBQ2QsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsU0FBTyxRQUFRO0FBQ2pCOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source = "Wildsea_primary"
+       field       = "updateUserSettings"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Mutation"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["updatedUserSettings"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // subscription/updatedUserSettings/updatedUserSettings.ts
            import {
              util,
              extensions
            } from "@aws-appsync/utils";
            
            // lib/constants/entityTypes.ts
            var TypeSettings = "SETTINGS";
            
            // subscription/updatedUserSettings/updatedUserSettings.ts
            function request(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              return { payload: {} };
            }
            function response(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              const filter = {
                userId: { eq: identity.sub },
                type: { eq: TypeSettings }
              };
              extensions.setSubscriptionFilter(util.transform.toSubscriptionFilter(filter));
              return null;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsidXBkYXRlZFVzZXJTZXR0aW5ncy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2VudGl0eVR5cGVzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBO0FBQUEsRUFDRTtBQUFBLEVBRUE7QUFBQSxPQUVLOzs7QUNFQSxJQUFNLGVBQWU7OztBRENyQixTQUFTLFFBQVEsU0FBa0I7QUFDeEMsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFHdEMsU0FBTyxFQUFFLFNBQVMsQ0FBQyxFQUFFO0FBQ3ZCO0FBRU8sU0FBUyxTQUFTLFNBQXdCO0FBQy9DLE1BQUksQ0FBQyxRQUFRLFNBQVUsTUFBSyxhQUFhO0FBQ3pDLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxVQUFVLElBQUssTUFBSyxhQUFhO0FBR3RDLFFBQU0sU0FBUztBQUFBLElBQ2IsUUFBUSxFQUFFLElBQUksU0FBUyxJQUFJO0FBQUEsSUFDM0IsTUFBTSxFQUFFLElBQUksYUFBYTtBQUFBLEVBQzNCO0FBQ0EsYUFBVyxzQkFBc0IsS0FBSyxVQUFVLHFCQUFxQixNQUFNLENBQUM7QUFFNUUsU0FBTztBQUNUOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source = "Wildsea_primary_local"
+       field       = "updatedUserSettings"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Subscription"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1441](https://github.com/jarrod-lowe/wildsea/actions/runs/16613810627)